# 1. შექმენით ცვლადი სახელად name, სადაც მომხმარებელს input-ის მეშვეობით შემოატანინებთ სახელს, შემდეგ კი მისალმების მესიჯი, მაგალითად 'hello ' + (სახელი).

name = input('input name')
print ('hello' + ' ' + name)

# 2. შექმენით სამი ცვლადი, სამივეში შეინახეთ განსხვავებული ინფორმაციის ტიპები, შემდეგ კი დაპრინტეთ ისინი.

a = 3.14
b = 3
c = '3'

print(a)
print(b)
print(c)

# 3. შექმენით ცვლადი სახელად user_name, სადაც მომხარებელს შემოატანინებთ სახელს, შემდეგ შექმენით ცვლადი სახელად last_name, სადაც მომხმარებელს შემოატანინებთ გვარს, ბოლოს დაუპრინტეთ მსგავსი მესიჯი: 'hello ' + (სახელი) + (გვარი).
user_name = input ('enter ur name')
last_name = input ( 'enter ur lastname')

print('hello' + user_name + last_name)


# 4. კომენტარში ახსენით რა არის input და output, შემდეგ ახსენით რა არის კარგი პრაქტიკები და რომელი კარგი პრაქტიკები ვიცით.

# input - არის როცა მომხმარებელს შეჰყავს ტექსტი მაგალითად: name = input('enter your name') - ამით ეს კოდი თხოვს მომხმარებელს რომ სახელი შემოიტანოს.


# output - არის ტერმინალში გამოტანა კოდის მაგალითათ: print(name) - ამ კოდს გამოაქვს ცვლადის შიგთავსი ტერმინალში




# 5. შექმენით ორი ცვლადი, სადაც მომხმარებელს შემოატანინებთ ორ რიცხვს, შეასრულეთ ამ რიცხვებზე შეკრება, გამოკლება, გამრავლება, გაყოფა და დაპრინტეთ შედეგები, (მინიშნება: input() მთლიანათ გადააქციეთ ინტეჯერად, int() ფუნქციის მეშვეობით).

A = int(input('enter first number'))
B = int(input('enter second number'))

print(A + B)
print(A - B)
print(A * B)
print(A ** B)
print(A / B)
print(A // B)