# 1.  ჩამოთვალე და კომენტარების მეშვეობით ახსენი პითონში არსებული 3 ინფორმაციის ტიპი (int, float, str).

# int - რიცხვი (მაგ: 4)
# str - ტექსტი რომელიც აუცილებლად უნდა იყოს ბრჭყალებში (მაგ: 'hello world')
# float - მეათედი (მაგ: 3.14)

# 2. შექმენი 3 ცვლადი, სამივეში შეინახე განსხვავებული ინფორმაციის ტიპები, საბოლოოდ type() ფუნქციის გამოყენებით დაპრინტე მათი ტიპები.

a = 1
b = '1'
c = 1.1

print(type(a))
print(type(b))
print(type(c))

# 3. მომხმარებელს Input()-ით შემოატანინე 2 რიცხვი და ამ ორ რიცხვზე გააკეთე გაყოფა, გამრავლება, მიმატება, გამოკლება (By Ilia Dzindzibadze).

d = int(input('num 1:'))
e = int(input('num 2:'))

print(d + e)
print(d - e)
print(d / e)
print(d * e) 

# 3. შექმენი ცვლადი, რომელშიც თავიდან შეინახავ "5"-ს, შემდეგ ეს ცვლადი გადააქციე integer-ად და დაპრინტე.

f = int("5")
print(f)

# 4. შექმენი ცვლადი, რომელშიც თავიდან შეინახავ 6-ს, შემდეგ ეს ცვლადი გადააქციე float-ად და დაპრინტე (By Ilia Dzindzibadze).

g = float(6)
print(g)

# 5. დაწერე კოდი, სადაც გამოიყენებ ორივე ტიპის გაყოფას (/ და //), დააკვირდი რა განსხვავებაა მათ შორის და დაწერე კომენტარში.


print(d / e) # აუთფუთი არის  float ში
print(d // e) # აუთფუთი არის ინტ


