# 1. შექმენით 2 ცვლადი, ერთში შეინახეთ ინტეჯერი, მეორეში სტრინგი და დაპრინტეთ მათი ჯამი, შედეგი უნდა იყოს ინტეჯერი.

A = int('2') 
B = 2

print(A + B)


# 2. შექმენით 2 ცვლადი, ერთში შეინახეთ ინტეჯერი, მეორეში სტრინგი და დაპრინტეთ მათი ჯამი, შედეგი უნდა იყოს სტრინგი.

C = '2'
D = str(2)  

print(C + D)

# 3. მომხმარებელს input-ის მეშვეობით შემოატანინეთ რიცხვი, შემდეგ შექმენით ცვლადი, სადაც შეინახავთ რამე სხვა ციფრს, ბოლოს დაპრინტეთ input-ში შემოტანილი ციფრის და თქვემი ცვლადის ჯამი.
 

E = int(input('enter num'))
F = 5

print(E + F)
